Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh1-6-v3.tmx
Source language: bo
Languages: en

source: བཅོམ་ལྡན་འདས་གང་ན་བ་དེར་སོང་ནས་ཕྱིན་པ་དང་། བཅོམ་ལྡན་འདས་ལ་ལྷའི་མུ་ཏིག་གིས་གཏོར་ནས། བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་གཉིས་ལ་མགོ་བོས་ཕྱག་བྱས་ཏེ། བཅོམ་ལྡན་འདས་དང་དགེ་སློང་གི་དགེ་འདུན་ལ་མདུན་གྱིས་བལྟས་ནས་ལྷོ་ཕྱོགས་སུ་བརྟེན་ཏེ་འདུག་གོ།
en: When he arrived, he scattered the divine pearls for the Blessed One, bowed low until his forehead touched the Blessed One’s feet, then sat to the south, attending the Blessed One and the community of monks.

source: །རྒྱལ་པོ་ཆེན་པོ་མིག་མི་བཟང་ཡང་ཀླུ་དུ་མའི་འཁོར་དང་། ཀླུ་བརྒྱ་ཕྲག་དུ་མའི་འཁོར་དང་། ཀླུ་སྟོང་ཕྲག་དུ་མའི་འཁོར་དང་། ཀླུ་བརྒྱ་སྟོང་ཕྲག་དུ་མའི་འཁོར་དང་། ལྷའི་མེ་ཏོག་ཨུཏྤ་ལ་དང་། པད་མ་དང་། ཀུ་མུ་ད་དང་། པད་མ་དཀར་པོ་དང་། མན་དཱ་ར་བ་རྣམས་ཀྱིས་ཐུ་བ་བཀང་ནས་བཅོམ་ལྡན་འདས་གང་ན་བ་དེར་སོང་སྟེ་ཕྱིན་པ་དང་། བཅོམ་ལྡན་འདས་ལ་ལྷའི་མེ་ཏོག་ཨུཏྤ་ལ་དང་། པད་མ་དང་། ཀུ་མུ་ད་དང་། པད་མ་དཀར་པོ་དང་། མན་དཱ་ར་བ་རྣམས་ཀྱིས་གཏོར་ནས།
en: Great King Virūpākṣa, too, with many hundreds and thousands—hundreds of thousands—of attendants, all of whom were nāgas, went to the Blessed One, with the front part of his garment filled with divine utpala, padma, kumuda, puṇḍarīka, and māndāraka flowers.

source: བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་གཉིས་ལ་མགོ་བོས་ཕྱག་བྱས་ཏེ། བཅོམ་ལྡན་འདས་དང་དགེ་སློང་གི་དགེ་འདུན་ལ་མདུན་གྱིས་བལྟས་ནས་ནུབ་ཕྱོགས་སུ་བརྟེན་ཏེ་འདུག་གོ།
en: When he arrived, he scattered the divine utpala, padma, kumuda, puṇḍarīka, and māndāraka flowers for the Blessed One, bowed low until his forehead touched the Blessed One’s feet, then sat to the west, attending the Blessed One and the community of monks.

source: །རྒྱལ་པོ་ཆེན་པོ་རྣམ་ཐོས་ཀྱི་བུ་ཡང་གནོད་སྦྱིན་དུ་མའི་འཁོར་དང་། གནོད་སྦྱིན་བརྒྱ་ཕྲག་དུ་མའི་འཁོར་དང་། གནོད་སྦྱིན་སྟོང་ཕྲག་དུ་མའི་འཁོར་དང་། གནོད་སྦྱིན་བརྒྱ་སྟོང་ཕྲག་དུ་མའི་འཁོར་དང་། ལྷའི་དབྱིག་དང་། གསེར་གྱིས་ཐུ་བ་བཀང་སྟེ།
en: Great King Vaiśravaṇa, too, with many hundreds and thousands—hundreds of thousands—of attendants, all of whom were yakṣas, went to the Blessed One, with the front part of his garment filled with pieces of divine gold.

source: བཅོམ་ལྡན་འདས་གང་ན་བ་དེར་སོང་ནས་ཕྱིན་པ་དང་། བཅོམ་ལྡན་འདས་ལ་ལྷའི་དབྱིག་དང་། གསེར་གྱིས་གཏོར་ནས་བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་གཉིས་ལ་མགོ་བོས་ཕྱག་བྱས་ཏེ། བཅོམ་ལྡན་འདས་དང་དགེ་སློང་གི་དགེ་འདུན་ལ་མདུན་གྱིས་བལྟས་ནས་བྱང་ཕྱོགས་སུ་བརྟེན་ཏེ་འདུག་གོ།
en: When he arrived, he scattered the pieces of divine gold for the Blessed One, bowed low until his forehead touched the Blessed One’s feet, then sat to the north, attending the Blessed One and the community of monks.

source: །དེ་ལ་དབུས་པའི་རིགས་ནི་གཉིས་ཏེ།
en: Among those four, those who had their origin in the midlands were two:

source: ཡུལ་འཁོར་སྐྱོང་དང་། འཕགས་སྐྱེས་པོའོ།
en: Dhṛtarāṣṭra and Virūḍhaka;

source: །མཐའ་འཁོབ་པའི་རིགས་ནི་གཉིས་ཏེ།
en: those who had their origin in the borderlands were two:

source: མིག་མི་བཟང་དང་། རྣམ་ཐོས་ཀྱི་བུའོ།
en: Virūpākṣa and Vaiśravaṇa.

source: །དེ་ནས་བཅོམ་ལྡན་འདས་འདི་སྙམ་དུ་དགོངས་ཏེ། གལ་ཏེ་ངས་དབུས་པའི་ཚིག་གིས་ཆོས་བཤད་ན་གཉིས་ཁོ་ནས་ཤེས་པར་འགྱུར་གྱི་གཉིས་ཀྱིས་ནི་མི་ཤེས་ལ།
en: Thereupon the Blessed One thought, “If I preach the Dharma in the language of the midlands, only two of them will understand, while the other two will not.

source: གལ་ཏེ་མཐའ་འཁོབ་པའི་ཚིག་གིས་བཤད་ན་གཉིས་ཁོ་ནས་ཤེས་པར་འགྱུར་གྱི་གཉིས་ཀྱིས་ནི་མི་ཤེས་པས་མ་ལ་ངས་གཉིས་ལ་ནི་དབུས་པའི་ཚིག་གིས་ཆོས་བཤད་དོ།
en: If I preach the Dharma in the language of the borderlands, only two of them will understand, while the other two will not.

source: །གཉིས་ལ་ནི་མཐའ་འཁོབ་པའི་ཚིག་གིས་ཆོས་བཤད་དོ་སྙམ་དུ་དགོངས་ནས་རྒྱལ་པོ་ཆེན་པོ་ཡུལ་འཁོར་སྐྱོང་ལ་བཀའ་སྩལ་པ། རྒྱལ་པོ་ཆེན་པོ་འདི་ལྟར་ལུས་ཞིག་པ་དང་། ཚོར་བ་བསིལ་བར་གྱུར་པ་དང་། འདུ་ཤེས་འགགས་པ་དང་། འདུ་བྱེད་རྣམས་ཉེ་བར་ཞི་བ་དང་། རྣམ་པར་ཤེས་པ་ནུབ་པར་གྱུར་པ་དེ་ཉིད་སྡུག་བསྔལ་གྱི་མཐའ་ཡིན་ནོ།
en: I will now preach the Dharma to two in the language of the midlands and to the other two in the languages of the borderlands.” He said to Great King Dhṛtarāṣṭra, “Great King, thus the body is destroyed, feelings have become cool, perceptions have ceased, formations have been pacified, and consciousness has disappeared—this is the end of suffering.”

source: །ཆོས་ཀྱི་རྣམ་གྲངས་འདི་བཀའ་སྩལ་པ་ན་རྒྱལ་པོ་ཆེན་པོ་ཡུལ་འཁོར་སྐྱོང་དང་། དེ་དང་སྐལ་བ་མཉམ་པའི་དྲི་ཟ་བརྒྱ་སྟོང་ཕྲག་དུ་མ་ཆོས་རྣམས་ལ་ཆོས་ཀྱི་མིག་རྡུལ་མེད་ཅིང་དྲི་མ་དང་བྲལ་བ་སྐྱེས་སོ།
en: While this teaching device of the Dharma was being preached, the Dharma eye, which is free from dust and stain and with which he could observe every phenomenon, was generated in Great King Dhṛtarāṣṭra, as well as the hundreds of thousands of gandharvas belonging to the same tribe as he.

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་རྒྱལ་པོ་ཆེན་པོ་འཕགས་སྐྱེས་པོ་ལ་བཀའ་སྩལ་པ། རྒྱལ་པོ་ཆེན་པོ་དེ་ལ་ཁྱོད་ཀྱིས་མཐོང་བ་ལ་མཐོང་བ་ཙམ་དང་། ཐོས་པ་དང་། རྟོགས་པ་དང་། རྣམ་པར་ཤེས་པ་ལ་རྣམ་པར་ཤེས་པ་ཙམ་དུ་གྱིས་ཤིག །ཆོས་ཀྱི་རྣམ་གྲངས་འདི་བཀའ་སྩལ་པ་ན་རྒྱལ་པོ་ཆེན་པོ་འཕགས་སྐྱེས་པོ་དང་། དེ་དང་སྐལ་བ་མཉམ་པའི་གྲུལ་བུམ་བརྒྱ་སྟོང་ཕྲག་དུ་མ་ཆོས་རྣམས་ལ་ཆོས་ཀྱི་མིག་རྡུལ་མེད་ཅིང་དྲི་མ་དང་བྲལ་བ་སྐྱེས་སོ།
en: Thereupon the Blessed One said to Great King Virūḍhaka, “Great King, here, what you see, hear, think, and understand should be only seeing, hearing, thinking, and understanding.” While this teaching device of the Dharma was being preached, the Dharma eye, which is free from dust and stain and with which he could observe every phenomenon, was generated in Great King Virūḍhaka, as well as the hundreds of thousands of kumbhāṇḍas belonging to the same tribe as he.

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་རྒྱལ་པོ་ཆེན་པོ་མིག་མི་བཟང་ལ་བཀའ་སྩལ་པ། དེ་ལྟར་ན་རྒྱལ་པོ་ཆེན་པོ་ཨེ་ནེ་མེ་ནེ། དབ་བེ། ད་ཌབ་ཕེ་འདི་ཉིད་སྡུག་བསྔལ་གྱི་མཐའ་ཡིན་ནོ།
en: Thereupon the Blessed One said to Great King Virūpākṣa, “Therefore, Great King, ine mene dapphe daḍapphe. This is the end of suffering.”

source: །ཆོས་ཀྱི་རྣམ་གྲངས་འདི་བཀའ་སྩལ་པ་ན་རྒྱལ་པོ་ཆེན་པོ་མིག་མི་བཟང་དང་། དེ་དང་སྐལ་བ་མཉམ་པའི་ཀླུ་བརྒྱ་སྟོང་ཕྲག་དུ་མ་ཆོས་རྣམས་ལ་ཆོས་ཀྱི་མིག་རྡུལ་མེད་ཅིང་དྲི་མ་དང་བྲལ་བ་སྐྱེས་སོ།
en: While this teaching device of the Dharma was being preached, the Dharma eye, which is free from dust and stain and with which he could observe every phenomenon, was generated in Great King Virūpākṣa, as well as the hundreds of thousands of nāgas belonging to the same tribe as he.

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་རྒྱལ་པོ་ཆེན་པོ་རྣམ་ཐོས་ཀྱི་བུ་ལ་བཀའ་སྩལ་པ། དེ་ལྟར་ན་རྒྱལ་པོ་ཆེན་པོ་མཱ་ཥཱ། ཏུ་ཥཱ། སང་ཤཱ་མཱ། སརྦ་ཏྲ་བི་རཱ་ཌཱི་འདི་ཉིད་སྡུག་བསྔལ་གྱི་མཐའ་ཡིན་ནོ།
en: Thereupon the Blessed One said to Great King Vaiśravaṇa, “Therefore, Great King, māśā tuṣā saṃśāmā sarvatra virāḍi. This is the end of suffering.”

source: །ཆོས་ཀྱི་རྣམ་གྲངས་འདི་བཀའ་སྩལ་པ་ན། རྒྱལ་པོ་ཆེན་པོ་རྣམ་ཐོས་ཀྱི་བུ་དང་དེ་དང་སྐལ་བ་མཉམ་པའི་གནོད་སྦྱིན་བརྒྱ་སྟོང་ཕྲག་དུ་མ་ཆོས་རྣམས་ལ་ཆོས་ཀྱི་མིག་རྡུལ་མེད་ཅིང་དྲི་མ་དང་བྲལ་བ་སྐྱེས་སོ། །བཅོམ་ལྡན་འདས་ཀྱིས་དགོངས་པ།
en: While this teaching device of the Dharma was being preached, the Dharma eye, which is free from dust and stain and with which he could observe every phenomenon, was generated in Great King Vaiśravaṇa, as well as the hundreds of thousands of yakṣas belonging to the same tribe as he.

source: ད་ནི་བདག་ཡོངས་སུ་མྱ་ངན་ལས་འདའ་བའི་དུས་ལ་ཁད་ཀྱིས་ཉེ་ན།
en: Then the Blessed One thought, “Now I am gradually approaching the time to be completely emancipated.

source: སུ་ལ་བསྟན་པ་གཏད་ནས་ཡོངས་སུ་མྱ་ངན་འདའ།
en: To whom should I entrust my teachings before being completely emancipated?

source: གལ་ཏེ་ལྷ་རྣམས་ལ་ནི་ལྷ་རྣམས་བག་མེད་པ་ལ་དགའ་བ་མང་བས་ཡུན་རིང་དུ་གནས་པར་མི་འགྱུར་རོ། །འོན་ཏེ་མི་རྣམས་ལ་ནི་མི་ནི་ཚེ་ཐུང་བ་ཡིན་པས་དེ་བཞིན་དུ་ཡུན་རིང་དུ་གནས་པར་མི་འགྱུར་གྱི།
en: If I entrust them to gods, they will not last long, for gods are careless and enjoy much pleasure. But if I entrust them to humans, they will not last long, either, for humans have shorter lives.

source: མ་ལ་ངས་ལྷ་དང་། མི་རྣམས་དང་། དགེ་སློང་འོད་སྲུང་ལ་གཏད་ནས་ཡོངས་སུ་མྱ་ངན་ལས་འདའོ་སྙམ་དུ་དགོངས་ནས་རྒྱལ་པོ་ཆེན་པོ་ཡུལ་འཁོར་སྐྱོང་ལ་བཀའ་སྩལ་པ། རྒྱལ་པོ་ཆེན་པོ་ཁྱོད་ཀྱིས་ང་ཡོངས་སུ་མྱ་ངན་ལས་འདས་པའི་བསྟན་པ་ཤར་ཕྱོགས་ནས་བསྲུང་བ་བྱོས་ཤིག །རྒྱལ་པོ་ཆེན་པོ་འཕགས་སྐྱེས་པོ་ལ་བཀའ་སྩལ་པ།
en: I will now entrust them to these gods, humans, and the monk Kāśyapa before being completely emancipated.” Having thus thought, he said to Great King Dhṛtarāṣṭra, “Great King, you should protect my teachings in the east after I am completely emancipated.”

source: རྒྱལ་པོ་ཆེན་པོ་ཁྱོད་ཀྱིས་ཀྱང་ལྷོ་ཕྱོགས་ནས་བསྲུང་བ་བྱོས་ཤིག །རྒྱལ་པོ་ཆེན་པོ་མིག་མི་བཟང་ལ་བཀའ་སྩལ་པ།
en: He said to Great King Virūḍhaka, “Great King, you also should protect them in the south.”

source: རྒྱལ་པོ་ཆེན་པོ་ཁྱོད་ཀྱིས་ཀྱང་ནུབ་ཕྱོགས་ནས་བསྲུང་བ་བྱོས་ཤིག །རྒྱལ་པོ་ཆེན་པོ་རྣམ་ཐོས་ཀྱི་བུ་ལ་བཀའ་སྩལ་པ།
en: He said to Great King Virūpākṣa, “Great King, you also should protect them in the west.”

source: རྒྱལ་པོ་ཆེན་པོ་ཁྱོད་ཀྱིས་ཀྱང་བྱང་ཕྱོགས་ནས་བསྲུང་བ་བྱོས་ཤིག །དེ་ནས་རྒྱལ་པོ་ཆེན་པོ་བཞི་རབ་ཏུ་དགའ་བའི་ཡིད་ཀྱིས་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་ཇི་སྐད་སྩལ་པ་དེ་བཞིན་དུ་བགྱིའོ།
en: He said to Great King Vaiśravaṇa, “Great King, you also should protect them in the north.” Then the Four Great Kings, their minds pleased, said to the Blessed One, “May everything be as the Blessed One has said!

source: །བཅོམ་ལྡན་འདས་བདག་ཅག་གིས་བསྲུང་བར་བགྱི་ལགས་སོ་ཞེས་གསོལ་ནས།
en: O Blessed One, we will protect them.”

source: བཅོམ་ལྡན་འདས་ལས་བདེན་པ་མཐོང་ནས་ཞབས་གཉིས་ལ་མགོ་བོས་ཕྱག་བྱས་ཏེ།
en: Having thus spoken and seen the truths before the Blessed One, they bowed low until their foreheads touched the Blessed One’s feet, and then departed from the Blessed One’s presence.

source: བཅོམ་ལྡན་འདས་ཀྱི་སྤྱན་སྔ་ནས་དོང་བ་དང་། བཅོམ་ལྡན་འདས་ཀྱིས་ཚེ་དང་ལྡན་པ་འོད་སྲུང་ཆེན་པོ་ལ་བསྟན་པ་མཐའ་དག་གི་བྱ་བ་རྣམས་གཏད་ནས་ཚེ་དང་ལྡན་པ་ཀུན་དགའ་བོ་ལ་ཡང་བཀའ་སྩལ་པ།
en: The Blessed One entrusted all his teachings to the venerable Mahākāśyapa and said to the venerable Ānanda, “Ānanda, you also should exert yourself in carrying out your duties in accordance with the teachings.” 2. The Former Lives of the Four Great Kings

source: ཀུན་དགའ་བོ་ཁྱོད་ཀྱིས་ཀྱང་བསྟན་པའི་དོན་གྱི་བྱ་བ་ལ་བརྩོན་པར་གྱིས་ཤིག །དགེ་སློང་རྣམས་ཐེ་ཚོམ་སྐྱེས་ནས་ཐེ་ཚོམ་ཐམས་ཅད་གཅོད་པ་སངས་རྒྱས་བཅོམ་ལྡན་འདས་ལ་ཞུས་པ། བཙུན་པ་རྒྱལ་པོ་ཆེན་པོ་བཞི་རྣམས་ཀྱིས་ལས་ཅི་ཞིག་བགྱིས་ན། ལས་དེའི་རྣམ་པར་སྨིན་པས་རྒྱལ་པོ་ཆེན་པོ་བཞིར་གྱུར་ཅིང་། བཅོམ་ལྡན་འདས་ཀྱི་སྤྱན་སྔར་བདེན་པ་མཐོང་བར་བགྱིས་ལགས།
en: The monks, feeling doubtful, inquired of the Buddha, the Blessed One, the one who severs all doubts, “O Honored One, what karma did the Four Great Kings create that matured to cause them to become the Four Great Kings and see the truths in the presence of the Blessed One?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། དགེ་སློང་དག་འདི་དག་ཉིད་ཀྱིས་སྔོན་གྱི་ཚེ་རབས་གཞན་རྣམས་སུ་ལས་རྣམས་བྱས་ཤིང་བསགས་པ་ཚོགས་རྙེད་པ་ཞེས་བྱ་བ་ནས།
en: “Monks,” replied the Blessed One, “the actions were performed and accumulated by these ones themselves in other lives, accruing a heap of karma, whose conditions have ripened . . . . “. . .

source: །དགེ་སློང་དག་སྔོན་བྱུང་བ་བསྐལ་པ་བཟང་པོ་འདི་ཉིད་ལ་སྐྱེ་དགུ་རྣམས་ཀྱི་ཚེ་ལོ་ཉི་ཁྲི་ཐུབ་པ་ན་སྟོན་པ་ཞེས་བྱ་བ་ནས། ལྷ་དང་མི་རྣམས་ཀྱི་སྟོན་པ་སངས་རྒྱས་བཅོམ་ལྡན་འདས་འོད་སྲུང་ཞེས་བྱ་བ་འཇིག་རྟེན་དུ་བྱུང་ངོ་། །ཞེས་བྱ་བའི་བར་གོང་མ་བཞིན་དུའོ།
en: “Monks, at a certain point in this fortunate eon, when people’s lifespans were twenty thousand years long, there appeared in the world a teacher named Kāśyapa, who was . . . a teacher of gods and humans, a buddha, and a blessed one.

source: །དེའི་ཚེ་རྒྱ་མཚོ་ཆེན་པོ་ན་ཀླུ་གཉིས་ཤིག་གནས་ཏེ་དབུགས་འབྱིན་དང་། དབུགས་ཆེར་འབྱིན་ནོ།
en: At that time, there lived in the great ocean two nāgas named Śvāsa and Mahāśvāsa.

source: །ཤིང་ཤལ་མ་བརྩེགས་པ་ན་ཡང་ནམ་མཁའ་ལྡིང་གཉིས་ཤིག་ཡོད་པ་འགྲོ་བའི་དབང་ཕྱུག་དང་། གཙུག་གི་དབང་ཕྱུག་གོ།
en: There were two garuḍas named Aṭṭeśvara and Cūḍeśvara on a kūṭaśālmalī tree.

source: །གང་གི་ཚེ་དབུགས་འབྱིན་དང་དབུགས་ཆེར་འབྱིན་གཉིས་ལ་དེ་གཉིས་གནོད་པ་བྱེད་པ་དེའི་ཚེ་དེ་གཉིས་སའི་འོག་ཏུ་འགྲོ་བར་བྱེད་དོ།
en: Whenever these two attacked Śvāsa and Mahāśvāsa, the two nāgas escaped underground.

source: །ཇི་ཙམ་དུས་གཞན་ཞིག་ན་དབུགས་འབྱིན་དང་། དབུགས་ཆེར་འབྱིན་གཉིས་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་སྲུང་གི་སྤྱན་སྔར་སྐྱབས་སུ་སོང་ཞིང་བསླབ་པའི་གཞི་རྣམས་བླངས་པ་དང་། དེ་གཉིས་ལ་ནམ་མཁའ་ལྡིང་གིས་གནོད་པ་བྱ་བར་བརྩམས་པ་ལས། རི་རབ་ལ་རླུང་དང་ཆུའི་ཤུགས་བཞིན་དུ་རྡུགས་ནས་སླར་ལོགས་པ་དང་། དེ་གཉིས་ཀྱིས་སྨྲས་པ།
en: Later, after Śvāsa and Mahāśvāsa had sought refuge in the Perfectly Awakened One Kāśyapa and accepted the rules of training, the garuḍas again began to attack these two, but they were obstructed and repulsed, just as wind and water are obstructed and repulsed by Mount Sumeru.

source: ཤེས་ལྡན་དག་སྔོན་ནི་ཁོ་བོ་ཅག་གིས་ཁྱེད་ཅག་གནོད་པ་བྱས་ན་སའི་འོག་ཏུ་འགྲོ་ན།
en: The two garuḍas then inquired of them, ‘Sirs, when we attacked you before, you used to escape underground.

source: ད་གང་གིས་ན་ཁོ་བོ་ཅག་ཁྱེད་དང་ཕྲད་ནས་རི་རབ་ལ་རླུང་དང་ཆུ་བཞིན་དུ་རྡུགས་ནས་ཕྱིར་ལྡོག་པ་འདི་ལ་རྒྱུ་ཅི་ཞིག་ཡོད།
en: Why, when we meet you now, are we obstructed and repulsed, just as wind and water are obstructed and repulsed by Mount Sumeru? What is the cause of this?’

source: དབུགས་འབྱིན་དང་དབུགས་ཆེར་འབྱིན་གྱིས་སྨྲས་པ། བདག་ཅག་གིས་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་སྲུང་གི་སྤྱན་སྔར་སྐྱབས་སུ་འགྲོ་བ་དང་བསླབ་པའི་གཞི་རྣམས་བླངས་སོ།
en: “Śvāsa and Mahāśvāsa answered, ‘We sought refuge in the Perfectly Awakened One Kāśyapa and accepted the rules of training.’

source: །དེ་གཉིས་ཀྱིས་སྨྲས་པ།
en: “ ‘If that is the case, we will do so, too,’ said the two garuḍas.

source: གལ་ཏེ་དེ་ལྟ་ན་བདག་ཅག་གིས་ཀྱང་བླང་ངོ་ཞེས་དེ་གཉིས་དེ་དག་དང་ལྷན་ཅིག་འགྲོགས་ཏེ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་སྲུང་གི་སྤྱན་སྔར་དོང་ནས་དེ་དག་ཕྱིན་པ་དང་། ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་སྲུང་གི་སྤྱན་སྔ་ནས་འཇིག་རྟེན་སྐྱོང་བ་བཞི་པོ་དག་གིས་ཆོས་ཐོས་ནས་དོང་བ་དེ་དག་དེ་གཉིས་ཀྱིས་མཐོང་ནས།
en: “The two garuḍas then went to the Perfectly Awakened One Kāśyapa with the two nāgas. When they arrived, they saw the Four Protectors of the World depart after they had heard the Dharma in the presence of the Perfectly Awakened One Kāśyapa.

source: ནམ་མཁའ་ལྡིང་དེ་གཉིས་ཀྱིས་ཀླུ་དབུགས་འབྱིན་དང་། དབུགས་ཆེར་འབྱིན་གཉིས་ལ་དྲིས་པ། འགྲོ་བ་ཕ་བི་དག་སུ་དག་ཡིན།
en: The two garuḍas asked the two nāgas, Śvāsa and Mahāśvāsa, ‘Who are those ones departing?’

source: དེ་གཉིས་ཀྱིས་རྒྱས་པར་སྨྲས་པ་དང་། ནམ་མཁའ་ལྡིང་གཉིས་ཀྱིས་སྨྲས་པ། གལ་ཏེ་དེ་ལྟར་བདག་ཅག་གིས་ཀྱང་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་སྲུང་གི་སྤྱན་སྔར་སྐྱབས་སུ་འགྲོ་བ་དང་བསླབ་པའི་གཞི་རྣམས་བླངས་ལ་སྨོན་ལམ་གདབ་བོ་ཞེས་དེ་གཉིས་ཀྱིས་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་སྲུང་ལས་སྐྱབས་སུ་འགྲོ་བ་དང་བསླབ་པའི་གཞི་རྣམས་བླངས་སོ།
en: “The two nāgas explained about this in detail, and the two garuḍas replied, ‘If that is the case, we will also seek refuge in the Perfectly Awakened One Kāśyapa, accept the rules of training, and make aspirations.’ The two garuḍas then did seek refuge in the Perfectly Awakened One Kāśyapa and accept the rules of training.

source: །དབུགས་འབྱིན་དང་དབུགས་ཆེར་འབྱིན་གཉིས་ནི་སྔར་བླངས་སོ།
en: Śvāsa and Mahāśvāsa had already accepted them before.

source: །དེ་ནས་ལྷན་ཅིག་འདུས་ནས་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་སྲུང་གི་ཞབས་གཉིས་ལ་གཏུགས་ནས་སྨོན་ལམ་བཏབ་པ།
en: Then they together threw themselves at the feet of the Perfectly Awakened One Kāśyapa and made these aspirations:

source: ཇི་ལྟར་འཇིག་རྟེན་སྐྱོང་བ་བཞི་པོ་འདི་དག་གིས་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་སྲུང་གི་སྤྱན་སྔར་ཆོས་མཉན་ནས་བདེན་པ་མཐོང་སྟེ་རང་གི་གནས་སུ་མཆིས་པ་དེ་བཞིན་དུ་བདག་ཅག་ཀྱང་དགེ་བའི་རྩ་བ་འདིས་འཇིག་རྟེན་སྐྱོང་བ་བཞིར་གྱུར་ཅིང་།
en: ‘Just as these Four Protectors of the World, after having heard the Dharma in the presence of the Perfectly Awakened One Kāśyapa, saw the truths and departed for their residences, may we also, by this root of merit, become the Four Protectors of the World!

source: བཅོམ་ལྡན་འདས་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་སྲུང་གིས་བྲམ་ཟེའི་ཁྱེའུ་བླ་མ་ཞེས་བགྱི་བ་གང་ལགས་པ་དེ་ལ་བྲམ་ཟེའི་ཁྱེའུ་ཁྱོད་སྐྱེ་དགུ་རྣམས་ཀྱི་ཚེ་ལོ་བརྒྱ་ཐུབ་པ་ན་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཤཱཀྱ་ཐུབ་པ་ཞེས་བྱ་བར་འགྱུར་རོ་ཞེས་ལུང་བསྟན་པའི་བཅོམ་ལྡན་འདས་དེས་ཀྱང་དེ་བཞིན་དུ་རྫིང་བུ་དལ་གྱིས་འབབ་ཀྱི་འགྲམ་དུ་བདག་ཅག་ལ་ཆོས་བཤད་དེ་བདག་ཅག་གིས་ཆོས་དེ་ཐོས་ནས་བདེན་པ་མཐོང་སྟེ། འདི་བཞིན་དུ་རང་གི་གནས་སུ་མཆི་བར་གྱུར་ཅིག་ཅེས་བྱས་སོ།
en: May that Blessed One, whom a young brahmin called Uttara was predicted to become by the Perfectly Awakened One Kāśyapa—“Young brahmin, you will become a tathāgata, an arhat, a perfectly awakened one called Śākyamuni when people’s lifespans are a hundred years long”—preach the Dharma for us on the bank of Mandākinī Lotus Pond! May we, too, after having heard the Dharma, see the truths and depart for our residences just as they did!’

source: ཀླུ་དང་ནམ་མཁའ་ལྡིང་བཞི་པོ་གང་དག་ཡིན་པ་དེ་དག་ནི་འཇིག་རྟེན་སྐྱོང་བ་བཞི་པོ་འདི་དག་ཉིད་ཡིན་ཏེ།
en: The ones who were those four—the nāgas and garuḍas—are indeed these Four Protectors of the World.

source: དེའི་ཚེ་དེའི་དུས་ན་དབུགས་འབྱིན་གང་ཡིན་པ་དེ་ནི་ཡུལ་འཁོར་སྐྱོང་འདི་ཉིད་ཡིན་ནོ།
en: That one who was Śvāsa at that time, on that occasion, is indeed this Dhṛtarāṣṭra.

source: །དབུགས་ཆེར་འབྱིན་གང་ཡིན་པ་དེ་ནི་འཕགས་སྐྱེས་པོ་ཡིན་ནོ།
en: That one who was Mahāśvāsa is indeed this Virūḍhaka.

source: །འགྲོ་བའི་དབང་ཕྱུག་ནི་མིག་མི་བཟང་ཡིན་ནོ།
en: That one who was Aṭṭeśvara is indeed this Virūpākṣa.

source: །གཙུག་གི་དབང་ཕྱུག་ནི་རྣམ་ཐོས་ཀྱི་བུ་ཡིན་ཏེ།
en: That one who was Cūḍeśvara is indeed this Vaiśravaṇa.

source: དེའི་ཚེ་དེའི་དུས་ན་འདི་དག་གིས་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་འོད་སྲུང་གི་སྤྱན་སྔར་སྐྱབས་སུ་འགྲོ་བ་དང་བསླབ་པའི་གཞི་རྣམས་བླངས་ཤིང་སྨོན་ལམ་བཏབ་པ་གང་ཡིན་པ་དེའི་ལས་ཀྱི་རྣམ་པར་སྨིན་པས་འཇིག་རྟེན་སྐྱོང་བ་བཞིར་གྱུར་ཅིང་ངའི་སྤྱན་སྔར་བདེན་པ་མཐོང་བར་བྱས་ནས་རང་གི་གནས་སུ་སོང་ངོ་།
en: Because of the maturation of that karma, namely, their seeking refuge in the Perfectly Awakened One Kāśyapa, accepting the rules of training, and making aspirations at that time, on that occasion, they became the Four Protectors of the World, saw the truths in my presence, and departed for their residences.” 3. Kaineya Offers Drinks to the Blessed One

source: །ཆོས་བཤད་པ་དེ་དྲང་སྲོང་ཀེ་ནའི་བུས་ཐོས་ནས་མཆོག་ཏུ་དགའ་བ་སྐྱེས་ཏེ། བཅོམ་ལྡན་འདས་ལ་མངོན་པར་དད་པར་གྱུར་ཏོ།
en: Having heard that Dharma preached, the ṛṣi Kaineya felt greatly pleased and was filled with faith in the Blessed One.

source: །དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་དེའི་བསམ་པ་དང་། བག་ལ་ཉལ་དང་། ཁམས་དང་། རང་བཞིན་མཁྱེན་ནས་གང་ཐོས་ནས་མོད་ལ་དྲང་སྲོང་ཀེ་ནའི་བུས་འཕགས་པའི་བདེན་པ་རྣམས་མངོན་པར་རྟོགས་ནས་ཕྱིར་མི་འོང་བའི་འབྲས་བུ་མངོན་སུམ་དུ་བྱས་པ་དེ་ལྟ་བུའི་ཆོས་བཤད་པ་མཛད་དོ།
en: The Blessed One knew his thinking, proclivity, disposition, and nature and preached the Dharma, through which the ṛṣi Kaineya penetrated the four truths of the noble ones and actualized the fruit of a never-returner.

source: །དེ་ནས་དེ་རྟོགས་པའི་དད་པ་དང་ལྡན་པར་གྱུར་ནས།
en: Thereupon, having acquired faith founded in knowledge, he went to the Blessed One, bringing eight kinds of drinks:

source: བཏུང་བ་བརྒྱད་པོ་ཙོ་ཙའི་བཏུང་བ་དང་། ཆུ་ཤིང་གི་འབྲས་བུའི་བཏུང་བ་དང་། རྒྱ་ཤུག་གི་བཏུང་བ་དང་། ཨ་ཤྭཏྠའི་བཏུང་བ་དང་། ཨུ་དུམ་བཱ་རའི་བཏུང་བ་དང་། རྩུབ་འགྱུར་གྱི་བཏུང་བ་དང་། འབྲ་གོའི་བཏུང་བ་དང་། རྒུན་གྱི་བཏུང་བ་ཁྱེར་ཏེ་བཅོམ་ལྡན་འདས་གང་ན་བ་དེར་སོང་སྟེ་ཕྱིན་པ་དང་། བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཙུན་པ་བཏུང་བ་བརྒྱད་པོ་འདི་དག་ནི་སྔོན་གྱི་དྲང་སྲོང་རྣམས་ཀྱིས་བསྟོད་ཅིང་བསྔགས་པ་ལགས་ཀྱིས། བཅོམ་ལྡན་འདས་ཐུགས་བརྩེ་བ་ཉེ་བར་བཟུང་སྟེ་བཞེས་སུ་གསོལ།
en: namely, coconut drink, banana drink, kola drink, aśvattha drink, udumbara drink, paruṣaka drink, kharjūra drink, and grape drink. When he arrived, he said to the Blessed One, “O Honored One, since these eight kinds of drinks are praised and extolled by ancient ṛṣis, may the Blessed One have compassion and accept them.”

source: བཅོམ་ལྡན་འདས་ཀྱིས་དྲང་སྲོང་ཀེ་ནའི་བུ་ལ་ཐུགས་བརྩེ་བར་དགོངས་ནས་བཏུང་བ་བརྒྱད་པོ་དག་བཞེས་སོ། །བཞེས་ནས་དགེ་སློང་རྣམས་ལ་བཀའ་སྩལ་པ།
en: The Blessed One did have compassion for the ṛṣi Kaineya and accepted the eight kinds of drinks.

source: དགེ་སློང་དག་བཏུང་བ་བརྒྱད་པོ་འདི་དག་དུས་སུ་བྱིན་ལེན་བྱས། དུས་སུ་མཉེས། དུས་སུ་བཙགས། དུས་སུ་བྱིན་གྱིས་བརླབས་ན་དུས་སུ་ལོངས་སྤྱད་པར་བྱ་ཞིང་དུས་མ་ཡིན་པར་ཡང་ལོངས་སྤྱད་པར་བྱ་ལ། ནམ་གྱི་ཐུན་དང་པོ་ཐལ་ནས་ནི་ལོངས་སྤྱད་པར་མི་བྱའོ།
en: Having accepted them, he said to the monks, “Monks, if these eight kinds of drinks have been accepted at the appropriate time (i.e., in the morning), squeezed at the appropriate time, and strained at the appropriate time, and if their formal possession has been taken at the appropriate time, they may be consumed at either the appropriate time or an inappropriate time (i.e., after noon), but they should not be consumed after the first watch of the night has passed.

source: །བཏུང་བ་བརྒྱད་པོ་འདི་དག་དུས་སུ་བྱིན་ལེན་བྱས་ལ་དུས་མ་ཡིན་པར་མཉེས། དུས་མ་ཡིན་པར་བཙགས། དུས་མ་ཡིན་པར་བྱིན་གྱིས་བརླབས་པ་ནི་ལོངས་སྤྱད་པར་མི་བྱའོ།
en: “If these eight kinds of drinks have been accepted at the appropriate time, but squeezed at an inappropriate time, and strained at an inappropriate time, and if their formal possession has been taken at an inappropriate time, they should not be consumed.

source: །བཏུང་བ་བརྒྱད་པོ་འདི་དག་དུས་སུ་བྱིན་ལེན་བྱས། དུས་སུ་མཉེས་ལ། དུས་མ་ཡིན་པར་བཙགས་དུས་མ་ཡིན་པར་བྱིན་གྱིས་བརླབས་པ་ནི་ལོངས་སྤྱད་པར་མི་བྱའོ།
en: “If these eight kinds of drinks have been accepted at the appropriate time, squeezed at the appropriate time, but strained at an inappropriate time, and if their formal possession has been taken at an inappropriate time, they should not be consumed.

source: །བཏུང་བ་བརྒྱད་པོ་འདི་དག་དུས་མ་ཡིན་པར་བྱིན་ལེན་བྱས། དུས་མ་ཡིན་པར་མཉེས། དུས་མ་ཡིན་པར་བཙགས་པ་ནི་ཟས་ཀྱི་འོག་ཏུ་ཡང་ལོངས་སྤྱད་པར་མི་བྱ་ལ། ནམ་གྱི་ཆ་སྟོད་འདས་ན་ཡང་ལོངས་སྤྱད་པར་མི་བྱའོ།
en: “If these eight kinds of drinks have been accepted at an inappropriate time, squeezed at an inappropriate time, and strained at an inappropriate time, they should neither be consumed after a meal nor after the first half of the night has passed.” 4. Śaila and Kaineya Go Forth

source: །དེ་ནས་དྲང་སྲོང་ཀེ་ནའི་བུ་སྟན་ལས་ལངས་ཏེ་བླ་གོས་ཕྲག་པ་གཅིག་ཏུ་གཟར་ནས་བཅོམ་ལྡན་འདས་གང་ན་བ་དེ་ལོགས་སུ་ཐལ་མོ་སྦྱར་བ་བཏུད་དེ། བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་དགེ་སློང་གི་དགེ་འདུན་དང་ཐབས་ཅིག་ཏུ་སང་བདག་གིས་གདུགས་ཆོད་སྦྱོར་ཞིང་མཆིས་ན་གནང་བར་མཛད་དུ་གསོལ།
en: Thereupon the ṛṣi Kaineya rose from his seat, draped his upper robe over one shoulder, made the gesture of supplication to the Blessed One, and said to him, “May the Blessed One together with the community of monks assent to my offer of a meal tomorrow.”

source: བཅོམ་ལྡན་འདས་ཀྱིས་དྲང་སྲོང་ཀེ་ནའི་བུ་ལ་ཅང་མི་གསུང་བས་གནང་ངོ་།
en: The Blessed One assented to the ṛṣi Kaineya by remaining silent.

source: །དེ་ནས་དྲང་སྲོང་ཀེ་ནའི་བུ་བཅོམ་ལྡན་འདས་ཅང་མི་གསུང་བས་གནང་བར་རིག་ནས་སྟན་ལས་ལངས་ཏེ་སོང་ངོ་།
en: Then the ṛṣi Kaineya, knowing that the Blessed One had assented by remaining silent, rose from his seat and departed.

source: །བཅོམ་ལྡན་འདས་ཀྱང་རྫིང་བུ་དལ་གྱིས་འབབ་ཀྱི་འགྲམ་ནས་མི་སྣང་བར་མཛད་དེ་དགེ་སློང་གི་དགེ་འདུན་དང་ཐབས་ཅིག་ཏུ་ཨ་དུ་མར་གཤེགས་སོ།
en: The Blessed One also disappeared from the bank of Mandākinī Lotus Pond and went to Ādumā with the community of monks.

source: །དེ་ནས་དྲང་སྲོང་ཀེ་ནའི་བུ་ནམ་མ་ལངས་པར་ལངས་ནས་ནང་མི་རྣམས་ལ་སྨྲས་པ།
en: The ṛṣi Kaineya rose before dawn and said to his family, “Noble ones, get up!

source: འཕགས་པ་དག་བཞེངས་ཤིག །བཞིན་བཟངས་དག་ལོངས་ཤིག །ཤིང་དག་གཤེགས་ཤིག །མེ་བུས་ཤིག །ཞལ་ཟས་དག་བྲིམ་པར་གྱིས་ཤིག །བཀད་ས་དག་བྱི་དོར་གྱིས་ཤིག །དེའི་ཚེ་དྲང་སྲོང་ཀེ་ནའི་བུའི་སྲིང་མོའི་བུ་དྲང་སྲོང་རི་བོ་ཞེས་བྱ་བ་གནས་དེ་ཉིད་དུ་ནུབ་མོ་གནས་བཏབ་པ་ལས།
en: Sirs, get up! Cut firewood! Light a fire! Distribute khādyaka! Clean the dining halls!” At that time, a ṛṣi named Śaila, who was a nephew of the ṛṣi Kaineya, was staying in that very house.

source: དྲང་སྲོང་རི་བོས་དྲང་སྲོང་ཀེ་ནའི་བུ་ནམ་མ་ལངས་པར་ལངས་ནས་ནང་མི་རྣམས་ལ་སྨྲ་བ་ཐོས་སོ། །ཐོས་ནས་ཀྱང་དྲང་སྲོང་ཀེ་ནའི་བུ་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །དྲང་སྲོང་ཅི་ཁྱོད་ཚངས་པ་མཚུངས་པར་སྤྱོད་པ་རྣམས་མགྲོན་དུ་བོས་སམ།
en: When the ṛṣi Śaila heard the ṛṣi Kaineya rise before dawn and speak to his family, he asked the ṛṣi Kaineya, “O ṛṣi, have you invited your fellow ṛṣis?

source: ཡུལ་མ་ག་དྷཱའི་རྒྱལ་པོ་བཟོ་སྦྱངས་གཟུགས་ཅན་སྙིང་པོའམ། ཕོ་བྲང་འཁོར་ན་གནས་པའི་སྐྱེ་བོའི་ཚོགས་སམ།
en: Have you invited King Śreṇya Bimbisāra of Magadha or people dwelling around the palace?
